Antoniazdz/ot-nrf528xx/src/nrf54l15/uart_nrf54.c
/*
 *  Copyright (c) 2016, The OpenThread Authors.
 *  All rights reserved.
 *
 *  Redistribution and use in source and binary forms, with or without
 *  modification, are permitted provided that the following conditions are met:
 *  1. Redistributions of source code must retain the above copyright
 *     notice, this list of conditions and the following disclaimer.
 *  2. Redistributions in binary form must reproduce the above copyright
 *     notice, this list of conditions and the following disclaimer in the
 *     documentation and/or other materials provided with the distribution.
 *  3. Neither the name of the copyright holder nor the
 *     names of its contributors may be used to endorse or promote products
 *     derived from this software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 *  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 *  IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 *  ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 *  LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 *  CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 *  SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 *  INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 *  CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 *  ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 *  POSSIBILITY OF SUCH DAMAGE.
 */

/**
 * @file
 *   OpenThread UART platform driver for nRF54L15 (from nRF52 uart.c, nRF54 HAL).
 *
 */

#include <openthread-core-config.h>
#include <openthread/config.h>

#include <stddef.h>
#include <stdint.h>

#include <utils/code_utils.h>
#include <utils/uart.h>
#include <openthread/platform/time.h>
#include <openthread/platform/toolchain.h>

#include "openthread-system.h"

#include "platform-nrf5-transport.h"
#include "nrf54_rcp_tput_stats.h"
#include <hal/nrf_gpio.h>
#include <hal/nrf_uarte.h>
#include "nrf_802154_clock.h"

#if (UART_AS_SERIAL_TRANSPORT == 1)

/**
 * UART enable flag.
 */
bool sUartEnabled = false;

/**
 * Upper bound for a busy wait on a transfer in progress. One transfer is at most
 * the size of the CLI TX ring, ~180 ms at the slowest supported baud rate, so this
 * only trips when ENDTX never arrives.
 */
#define UART_TX_WAIT_TIMEOUT_US 250000

/**
 * UART TX buffer variables.
 */
static const uint8_t *sTransmitBuffer = NULL;
static volatile bool  sTransmitDone   = 0;

/**
 * UART RX ring buffer variables.
 *
 * EasyDMA stores every incoming byte directly in the ring, so reception is
 * driven by ENDRX instead of RXDRDY: RXDRDY is raised before the byte has
 * reached RAM, which is why reading it used to require forcing the RX FIFO out
 * with FLUSHRX and spinning on ENDRX from inside the handler.
 *
 * sReceivePaused records that the handler left the receiver stopped because the
 * ring was full. Hardware flow control then deasserts RTS, so the peer stalls
 * rather than having bytes dropped on the floor.
 */
static uint8_t           sReceiveBuffer[UART_RX_BUFFER_SIZE];
static volatile uint16_t sReceiveHead   = 0;
static volatile uint16_t sReceiveTail   = 0;
static volatile bool     sReceivePaused = false;

/**
 * Function for returning the next RX buffer index.
 *
 * @return Next RX buffer index.
 */
static __INLINE uint16_t getNextRxBufferIndex()
{
    return (sReceiveHead + 1) % UART_RX_BUFFER_SIZE;
}

/**
 * Function for checking if RX buffer is full.
 *
 * @retval true  RX buffer is full.
 * @retval false RX buffer is not full.
 */
static __INLINE bool isRxBufferFull()
{
    return getNextRxBufferIndex() == sReceiveTail;
}

/**
 * Function for handing the slot that the next byte belongs in over to EasyDMA.
 *
 * The RX DMA pointer has a single writer, so this must run either from the UART
 * handler or with the UART interrupt masked.
 */
static void uarteRxArm(void)
{
    nrf_uarte_rx_buffer_set(UART_INSTANCE, &sReceiveBuffer[sReceiveHead], 1);
    nrf_uarte_task_trigger(UART_INSTANCE, NRF_UARTE_TASK_STARTRX);
}

/**
 * Function for notifying application about new bytes received.
 */
static void processReceive(void)
{
    uint16_t deliveredBytes;
    // Set head position to not be changed during read procedure.
    uint16_t head = sReceiveHead;
    uint8_t *position;

    nrf54RcpTputStatsNoteUartProcessReceiveStart();

    // In case head roll back to the beginning of the buffer, notify about left
    // bytes from the end of the buffer.
    if (head < sReceiveTail)
    {
        deliveredBytes = (uint16_t)(UART_RX_BUFFER_SIZE - sReceiveTail);
        position         = &sReceiveBuffer[sReceiveTail];
        otPlatUartReceived(position, deliveredBytes);
        nrf54RcpTputStatsNoteUartDelivered(deliveredBytes);
        sReceiveTail = 0;
    }

    // Notify about received bytes.
    if (head > sReceiveTail)
    {
        deliveredBytes = (uint16_t)(head - sReceiveTail);
        position         = &sReceiveBuffer[sReceiveTail];
        otPlatUartReceived(position, deliveredBytes);
        nrf54RcpTputStatsNoteUartDelivered(deliveredBytes);
        sReceiveTail = head;
    }

    // Reception was stopped because the ring was full: restart it now that the
    // bytes above have been handed over and there is room again.
    if (sReceivePaused)
    {
        NVIC_DisableIRQ(UART_IRQN);

        if (!isRxBufferFull())
        {
            sReceivePaused = false;
            uarteRxArm();
        }

        NVIC_EnableIRQ(UART_IRQN);
    }
}

/**
 * Function for waiting until the transfer in progress leaves the UARTE.
 *
 * @retval true   Transmission completed.
 * @retval false  Timed out, the transaction has to be dropped.
 */
static bool waitTransmitDone(void)
{
    uint64_t deadline = otPlatTimeGet() + UART_TX_WAIT_TIMEOUT_US;

    while (!sTransmitDone && otPlatTimeGet() < deadline)
    {
        // Wait until the transmission is done.
    }

    return sTransmitDone;
}

/**
 * Function for closing the transaction in progress without reporting it, i.e.
 * without calling otPlatUartSendDone().
 */
static void reapTransmit(void)
{
    otEXPECT(sTransmitBuffer != NULL);

    (void)waitTransmitDone();

    sTransmitBuffer = NULL;
    sTransmitDone   = false;

exit:
    return;
}

/**
 * Function for notifying application about transmission being done.
 */
static void processTransmit(void)
{
    otEXPECT(sTransmitBuffer != NULL);

    if (sTransmitDone)
    {
        // Clear Transmition transaction and notify application.
        sTransmitBuffer = NULL;
        sTransmitDone   = false;
        nrf54RcpTputStatsNoteUartTxDone();
        otPlatUartSendDone();
    }

exit:
    return;
}

otError otPlatUartFlush(void)
{
    /* Only wait for the data to go out: the caller reports the completion to
     * OpenThread itself (see cli_uart.cpp). Calling otPlatUartSendDone() here as
     * well made the CLI advance its TX ring twice and skip a chunk of output. */
    reapTransmit();

    return OT_ERROR_NONE;
}

void nrf5UartProcess(void)
{
    processReceive();
    processTransmit();
}

void nrf5UartInit(void)
{
    // Intentionally empty.
}

void nrf5UartClearPendingData(void)
{
    // Intentionally empty.
}

void nrf5UartDeinit(void)
{
    if (sUartEnabled)
    {
        otPlatUartDisable();
    }
}

otError otPlatUartEnable(void)
{
    otError error = OT_ERROR_NONE;

    otEXPECT_ACTION(sUartEnabled == false, error = OT_ERROR_ALREADY);

    // Set up TX and RX pins.
    nrf_gpio_pin_set(UART_PIN_TX);
    nrf_gpio_cfg_output(UART_PIN_TX);
    nrf_gpio_cfg_input(UART_PIN_RX, NRF_GPIO_PIN_NOPULL);
    nrf_uarte_txrx_pins_set(UART_INSTANCE, UART_PIN_TX, UART_PIN_RX);

#if (UART_HWFC_ENABLED == 1)
    // Set up CTS and RTS pins.
    nrf_gpio_cfg_input(UART_PIN_CTS, NRF_GPIO_PIN_NOPULL);
    nrf_gpio_pin_set(UART_PIN_RTS);
    nrf_gpio_cfg_output(UART_PIN_RTS);
    nrf_uarte_hwfc_pins_set(UART_INSTANCE, UART_PIN_RTS, UART_PIN_CTS);
#endif

    {
        nrf_uarte_config_t uarteConfig =
        {
            .hwfc   = (UART_HWFC_ENABLED == 1) ? NRF_UARTE_HWFC_ENABLED : NRF_UARTE_HWFC_DISABLED,
            .parity = UART_PARITY,
#if defined(UARTE_CONFIG_STOP_Msk)
            .stop = NRF_UARTE_STOP_ONE,
#endif
#if defined(UARTE_CONFIG_PARITYTYPE_Msk)
            .paritytype = NRF_UARTE_PARITYTYPE_EVEN,
#endif
#if NRF_UARTE_HAS_FRAME_TIMEOUT
            .frame_timeout = NRF_UARTE_FRAME_TIMEOUT_DIS,
#endif
#if NRF_UARTE_HAS_FRAME_SIZE
            .frame_size = NRF_UARTE_FRAME_SIZE_8_BIT,
            .endian     = NRF_UARTE_ENDIAN_LSB,
#endif
        };

        nrf_uarte_configure(UART_INSTANCE, &uarteConfig);
    }

    // Configure baudrate.
    nrf_uarte_baudrate_set(UART_INSTANCE, UART_BAUDRATE);

    // Clear UART specific events.
    nrf_uarte_event_clear(UART_INSTANCE, NRF_UARTE_EVENT_ENDTX);
    nrf_uarte_event_clear(UART_INSTANCE, NRF_UARTE_EVENT_ERROR);
    nrf_uarte_event_clear(UART_INSTANCE, NRF_UARTE_EVENT_ENDRX);

    // Enable interrupts for TX.
    nrf_uarte_int_enable(UART_INSTANCE, NRF_UARTE_INT_ENDTX_MASK);

    // Enable interrupts for RX.
    nrf_uarte_int_enable(UART_INSTANCE, NRF_UARTE_INT_ENDRX_MASK | NRF_UARTE_INT_ERROR_MASK);

    // Configure NVIC to handle UART interrupts.
    NVIC_SetPriority(UART_IRQN, UART_IRQ_PRIORITY);
    NVIC_ClearPendingIRQ(UART_IRQN);
    NVIC_EnableIRQ(UART_IRQN);

    // Start HFCLK (shared with radio; no ref-count on nRF54 — do not stop in Disable).
    nrf_802154_clock_hfclk_start();

    while (!nrf_802154_clock_hfclk_is_running())
    {
    }

    // Enable UART instance and arm 1-byte RX (EasyDMA on nRF54 UARTE).
    nrf_uarte_enable(UART_INSTANCE);

    sReceiveHead   = 0;
    sReceiveTail   = 0;
    sReceivePaused = false;

    uarteRxArm();

    sUartEnabled = true;

exit:
    return error;
}

otError otPlatUartDisable(void)
{
    otError error = OT_ERROR_NONE;

    otEXPECT_ACTION(sUartEnabled == true, error = OT_ERROR_ALREADY);

    // Disable NVIC interrupt.
    NVIC_DisableIRQ(UART_IRQN);
    NVIC_ClearPendingIRQ(UART_IRQN);
    NVIC_SetPriority(UART_IRQN, 0);

    // Disable interrupts for TX.
    nrf_uarte_int_disable(UART_INSTANCE, NRF_UARTE_INT_ENDTX_MASK);

    // Disable interrupts for RX.
    nrf_uarte_int_disable(UART_INSTANCE, NRF_UARTE_INT_ENDRX_MASK | NRF_UARTE_INT_ERROR_MASK);

    // Disable UART instance.
    nrf_uarte_disable(UART_INSTANCE);

    // Keep processReceive() from re-arming RX on a disabled instance.
    sReceivePaused = false;

    sUartEnabled = false;

exit:
    return error;
}

otError otPlatUartSend(const uint8_t *aBuf, uint16_t aBufLength)
{
    otError error = OT_ERROR_NONE;

    /* A caller handing over a new buffer has already accounted for the previous
     * one, so close that transaction silently instead of reporting it again from
     * here: the report would start a nested transfer and this buffer would then be
     * rejected as busy and lost. */
    reapTransmit();

    otEXPECT_ACTION(sTransmitBuffer == NULL, error = OT_ERROR_BUSY);

    // Set up transmit buffer.
    sTransmitBuffer = aBuf;

    // Initiate transmission process.
    nrf_uarte_event_clear(UART_INSTANCE, NRF_UARTE_EVENT_ENDTX);
    nrf_uarte_tx_buffer_set(UART_INSTANCE, sTransmitBuffer, aBufLength);
    nrf_uarte_task_trigger(UART_INSTANCE, NRF_UARTE_TASK_STARTTX);

exit:
    return error;
}

/**
 * Interrupt handler of UART peripheral (instance from transport-config.h).
 */
void UART_IRQ_HANDLER(void)
{
    // Check if any error has been detected.
    if (nrf_uarte_int_enable_check(UART_INSTANCE, NRF_UARTE_INT_ERROR_MASK) &&
        nrf_uarte_event_check(UART_INSTANCE, NRF_UARTE_EVENT_ERROR))
    {
        nrf_uarte_event_clear(UART_INSTANCE, NRF_UARTE_EVENT_ERROR);
    }

    if (nrf_uarte_int_enable_check(UART_INSTANCE, NRF_UARTE_INT_ENDRX_MASK) &&
        nrf_uarte_event_check(UART_INSTANCE, NRF_UARTE_EVENT_ENDRX))
    {
        // Clear ENDRX event.
        nrf_uarte_event_clear(UART_INSTANCE, NRF_UARTE_EVENT_ENDRX);

        nrf54RcpTputStatsNoteUartEndRxIrq();

        // EasyDMA has already stored the byte at sReceiveHead.
        sReceiveHead = getNextRxBufferIndex();

        if (isRxBufferFull())
        {
            // Leave the receiver stopped rather than overwriting bytes that
            // processReceive() has not handed over yet. RTS is deasserted while
            // RX is down, so the peer stalls instead of losing data.
            sReceivePaused = true;
        }
        else
        {
            uarteRxArm();
        }

        otSysEventSignalPending();
    }

    if (nrf_uarte_event_check(UART_INSTANCE, NRF_UARTE_EVENT_ENDTX))
    {
        // Clear ENDTX event.
        nrf_uarte_event_clear(UART_INSTANCE, NRF_UARTE_EVENT_ENDTX);

        sTransmitDone = true;

        nrf_uarte_task_trigger(UART_INSTANCE, NRF_UARTE_TASK_STOPTX);

        otSysEventSignalPending();
    }
}

#endif // UART_AS_SERIAL_TRANSPORT == 1

/**
 * The UART driver weak functions definition.
 *
 */
OT_TOOL_WEAK void otPlatUartSendDone(void)
{
}

OT_TOOL_WEAK void otPlatUartReceived(const uint8_t *aBuf, uint16_t aBufLength)
{
    OT_UNUSED_VARIABLE(aBuf);
    OT_UNUSED_VARIABLE(aBufLength);
}
